m-waleed-h/stm32-fyp/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_PIN_Pin GPIO_PIN_13
#define LED_PIN_GPIO_Port GPIOC
#define LATCH_7_Pin GPIO_PIN_14
#define LATCH_7_GPIO_Port GPIOC
#define LATCH_8_Pin GPIO_PIN_15
#define LATCH_8_GPIO_Port GPIOC
#define LATCH_SELECT_1_Pin GPIO_PIN_0
#define LATCH_SELECT_1_GPIO_Port GPIOC
#define LATCH_SELECT_2_Pin GPIO_PIN_1
#define LATCH_SELECT_2_GPIO_Port GPIOC
#define LATCH_SELECT_3_Pin GPIO_PIN_2
#define LATCH_SELECT_3_GPIO_Port GPIOC
#define RTC_INT_In_Pin GPIO_PIN_3
#define RTC_INT_In_GPIO_Port GPIOC
#define RTC_INT_In_EXTI_IRQn EXTI3_IRQn
#define LATCH_6_Pin GPIO_PIN_0
#define LATCH_6_GPIO_Port GPIOA
#define LATCH_5_Pin GPIO_PIN_1
#define LATCH_5_GPIO_Port GPIOA
#define RTC_32KHZ_In_Pin GPIO_PIN_2
#define RTC_32KHZ_In_GPIO_Port GPIOA
#define RTC_32KHZ_In_EXTI_IRQn EXTI2_IRQn
#define Input_1_Pin GPIO_PIN_3
#define Input_1_GPIO_Port GPIOA
#define Input_2_Pin GPIO_PIN_4
#define Input_2_GPIO_Port GPIOA
#define Input_3_Pin GPIO_PIN_5
#define Input_3_GPIO_Port GPIOA
#define Input_4_Pin GPIO_PIN_6
#define Input_4_GPIO_Port GPIOA
#define Input_5_Pin GPIO_PIN_7
#define Input_5_GPIO_Port GPIOA
#define LATCH_3_Pin GPIO_PIN_0
#define LATCH_3_GPIO_Port GPIOB
#define LATCH_4_Pin GPIO_PIN_1
#define LATCH_4_GPIO_Port GPIOB
#define Input_6_Pin GPIO_PIN_8
#define Input_6_GPIO_Port GPIOA
#define LATCH_1_Pin GPIO_PIN_4
#define LATCH_1_GPIO_Port GPIOB
#define LATCH_2_Pin GPIO_PIN_5
#define LATCH_2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
